Revit 2026 API

# SchedulableField Methods

---

The SchedulableField type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | Equals | Determines whether the specified Object is equal to the current Object. (Overrides ObjectEquals(Object)) |
|  | GetCustomFieldData | Gets the data associated with this custom field. If this field isn't a CustomField will return . |
|  | GetHashCode | Gets the integer value of the SchedulableField as hash code (Overrides ObjectGetHashCode) |
|  | GetName | Gets the name of the field. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

SchedulableField Class

Autodesk.Revit.DB Namespace